{
  "Lady Margaret Hall": [
    {
      "postId": "1071808491616337",
      "text": "SW@lmh my bnoc friend from hughs college has a thing against you but i think ur cool"
    },
    {
      "postId": "1043051647825355",
      "text": "Blow us all away"
    },
    {
      "postId": "1014944133969440",
      "text": "Raspberry"
    },
    {
      "postId": "1013453737451813",
      "text": "The LMH scooter girl always in the grey zipup is a real life manic pixie dream girl. I saw u going past college with a huge baguette in your basket, and I think I could overhear u blasting PJ Harvey through ur headphones at the lights. Ngl the scooter looks ricketty af but ur still hot"
    },
    {
      "postId": "1001329051997615",
      "text": "oxHATE to finding out what the fox says in LMH tonight 💔"
    },
    {
      "postId": "1000922898704897",
      "text": "Oxlove to the girl in LMH library blasting Taylor Swift through loud headphones for six straight hours, are you okay"
    },
    {
      "postId": "983530620444125",
      "text": "Oxlove to MT@LMH in cambridge today, your outfit was super cute"
    },
    {
      "postId": "964125189051335",
      "text": "Okay, you have a curly mullet and based on your tote I think you go to LMH but also you’re so gorgeous and this is me proposing. You have a leather jacket and blue jeans?"
    },
    {
      "postId": "960430772754110",
      "text": "Oxhate to the LMH balloting system"
    },
    {
      "postId": "958576306272890",
      "text": "massive oxlove to the hard work and dedication of the LMH JCR Vice Pres (IG) - you’ve done such an amazing job with the ballot and halfway hall"
    },
    {
      "postId": "958414119622442",
      "text": "oxlove to the girl in red @ lmh karaoke you were tearing it tf UP!!!!!!!"
    },
    {
      "postId": "956759049787949",
      "text": "Oxlove to SS@LMH at uni parks this morn, might have fallen in love seeing you nearly falling over trying to pet a dog"
    },
    {
      "postId": "937724535024734",
      "text": "Oxhate to the last LMH JCR treasurer for not ever donating £4k raised for charity during his term"
    },
    {
      "postId": "937605188370002",
      "text": "why do LMH people put LM in front of everything, like i understand words that begin with H like LMHome, but i don’t get LMBar etc."
    },
    {
      "postId": "935265935270594",
      "text": "LMH MCR starting the year strong with £1000 of debt 🫶"
    },
    {
      "postId": "929714095825778",
      "text": "oxhate to LMH increasing the coffee machine price to 70p from 50p, how am i meant to get through this term now"
    },
    {
      "postId": "929383795858808",
      "text": "oxhate to the LMH bop themes for last term and this term. bring back the polls so we can vote! #LMDemocracy"
    },
    {
      "postId": "929378805859307",
      "text": "Oxextremelysorry to the person who was in the LMH library at 4am we did not realise we weren’t alone so apologies for the noise"
    }
  ],
  "St Hugh's": [
    {
      "postId": "1071808491616337",
      "text": "SW@lmh my bnoc friend from hughs college has a thing against you but i think ur cool"
    },
    {
      "postId": "1043051647825355",
      "text": "The Story of Tonight"
    },
    {
      "postId": "1033936822070171",
      "text": "Oxhate to the Kenyon shitter at Hugh's. Go see a doctor..."
    },
    {
      "postId": "1020631360067384",
      "text": "oxreminder to the person living in MTB building at st hughs having aggressively loud sex in the middle of the day, we can hear you from the lawns outside- close your windows next time!"
    },
    {
      "postId": "1014944133969440",
      "text": "Grapefruit"
    },
    {
      "postId": "1013450547452132",
      "text": "just overheard someone call st hughs cat Admiral Flapjack “Flappy”. do not disrespect her like that ever again"
    },
    {
      "postId": "1003359795127874",
      "text": "oxhate to hughs for making us buy drinks from them at formals instead of bringing our own. it wont bring in more money it will just make people avoid formals"
    },
    {
      "postId": "988249906638863",
      "text": "what is going on with hugh’s garden party. why are tix gonna be so spenny (considering no advertising)… also when will they be released??"
    },
    {
      "postId": "977574601039727",
      "text": "Oxlove to EB@Hughs for the banging morocco pics we’re too vain"
    },
    {
      "postId": "975152824615238",
      "text": "Oxlove to all the Hugh’s freshers couples you’re all so cute"
    },
    {
      "postId": "964414055689115",
      "text": "Oxlove to the guy who wore a pair of sunglasses last Friday around the st Hugh’s area. You definitely did not look 25."
    },
    {
      "postId": "964185335711987",
      "text": "Oxlove to that one girl from Hugh’s who’s always out"
    },
    {
      "postId": "956994109764443",
      "text": "same for LP@Hugh's... feels like someone is using the jcr funds as their personal project fund"
    },
    {
      "postId": "956049416525579",
      "text": "#oxfess29575 \n#oxlove to the Hugh's cutie I've fallen for recently x"
    },
    {
      "postId": "951523880311466",
      "text": "I teach at several colleges but St Hugh's students are almost the most fun :-)"
    },
    {
      "postId": "946707040793150",
      "text": "Ah, dear Entz reps at St. Hugh's, let's talk about your halfway hall party...or should I say, halfway there in terms of fun! It's like Mean Girls decided to host a party and forgot to bring the humor along. Maybe it's time to stick to your own clique drama and leave our party waters untainted. Cheers to hoping your next event has more pizzazz and less Regina George vibes!"
    },
    {
      "postId": "944424834354704",
      "text": "hughs entz reps... don't quote mean girls u guys are literally the plastics"
    },
    {
      "postId": "941445277985993",
      "text": "Another Hugh’s student here. Would like to share more oxhate to our entz reps and their childish friendship group who strut around the college like they own it. #meangirls."
    },
    {
      "postId": "941234444673743",
      "text": "oxhate to st hughs halfway hall for being dominated by the entz team’s friendship group … this isn’t high school: you’re not cool"
    },
    {
      "postId": "927761112687743",
      "text": "keep reading stuff that saltburn filmed at hugh’s, anyone know what scene?? pls help a hughsie am desperate to know where exactly jacob elordi was on our lawns"
    },
    {
      "postId": "922947696502418",
      "text": "Hughs library is echoey please don’t loudly whisper for 3 hours straight it’s annoying"
    }
  ],
  "Nuffield": [
    {
      "postId": "1070802891716897",
      "text": "What’s the goss about Nuffield college... is it true what they say about it being... incestuous?"
    }
  ],
  "University": [
    {
      "postId": "1070072838456569",
      "text": "MC @ univ is single-handedly to blame for Pret ending their subscription. Direct all blame that way🫵🫵🫵"
    },
    {
      "postId": "1054111070052746",
      "text": "oxlove to the girl who was singing pink pony club on goodhart lawn in univ on wed of 9th week! gorgeous voice"
    },
    {
      "postId": "1047629830700870",
      "text": "Oxlove to the heavenly photographer on mount olympus (at univ ball) 😘❤️🤩🤤🤤🤤🤤🤤"
    },
    {
      "postId": "1047418324055354",
      "text": "Univ students not complain about the ball when it hasn't even happened yet challenge (impossible)"
    },
    {
      "postId": "1046685277461992",
      "text": "#oxfess31484 please follow up with a guide on how to infiltrate specific colleges like how tf do you get into univ i thought they used gorilla glue on the doors or sth"
    },
    {
      "postId": "1045865884210598",
      "text": "oxwhen will univ install a cat flap for lyra?!"
    },
    {
      "postId": "1043051647825355",
      "text": "You'll be Back"
    },
    {
      "postId": "1036357905161396",
      "text": "Univ has a criminally large rat problem..."
    },
    {
      "postId": "1035278235269363",
      "text": "Oxhate to the Univ couple who keep shagging with the windows open."
    },
    {
      "postId": "1030225912441262",
      "text": "#oxfess31122 \nSP @Univ Big Name In Greece 🇬🇷"
    },
    {
      "postId": "1026179949512525",
      "text": "Oxhate to univ for the ridiculous prices. How on earth can you charge £26 for a formal and wine isn’t included???? And why does the jcr not care it makes the fun parts of college life unaffordable for a good deal of people"
    },
    {
      "postId": "1020513296745857",
      "text": "Univ garden play genuinely is fantastic"
    },
    {
      "postId": "1018295070301013",
      "text": "My favourite Oxford tradition is the University begging students not to trash every year and students doing it anyway. Makes me feels so dominant and subversive. Please keep begging proctors!! It only makes me want to do it more. (Also remember everyone to get eco supplies before trashing guys <3)"
    },
    {
      "postId": "1014944133969440",
      "text": "Watermelon"
    },
    {
      "postId": "1014428537354333",
      "text": "Just collected a parcel from the univ lockers and it was my puffer that went missing a year ago?! 😮"
    },
    {
      "postId": "1007975547999632",
      "text": "my heart goes out to whoever just blasted univ lib with wannabe by the spice girls at full volume"
    },
    {
      "postId": "1001925265271327",
      "text": "Which balls are happening this term Univ, Hilda’s, Pembroke, Teddy, who have I missed..?"
    },
    {
      "postId": "1001329725330881",
      "text": "KK@Univ forget entrepreneurship and please oxfounder this girl's heart 😩😩😩"
    },
    {
      "postId": "1000388862091634",
      "text": "oxlove to the woman in the black parkrun top running laps of uni parks in the opposite direction to me, enjoyed the awkward greetings every lap."
    },
    {
      "postId": "999579035505950",
      "text": "Oxlove to the girl I saw storming through uni parks yesterday. You go girly 😍😍"
    },
    {
      "postId": "998417968955390",
      "text": "Oxwho is oxdrinks on tiktok and can they please review Univ next"
    },
    {
      "postId": "981891310608056",
      "text": "#oxfess30124 #oxlove to MB at U, you’ll be okay babes, we love you!!"
    },
    {
      "postId": "979572247506629",
      "text": "Old Kent Road: Univ"
    },
    {
      "postId": "979570604173460",
      "text": "Univ has to have the worst domestic bursar in the history of domestic bursars"
    },
    {
      "postId": "977573361039851",
      "text": "Oxlove to the univ insta admin asking daily if everyone’s having a good day. Would be having a better day if you’d hire a night porter xoxo"
    },
    {
      "postId": "974387151358472",
      "text": "Does anyone have a univ ball ticket they’re willing to sell please please please I will pay a small premium 🙏🏻🙏🏻🙏🏻🙏🏻"
    },
    {
      "postId": "955804706550050",
      "text": "Oxhate to the Univ student that pooped in our shared bathroom sink????"
    },
    {
      "postId": "945037274293460",
      "text": "Before Univ charges £1k again for some external company to do the clean up, I’m happy to do it for £500 Sincerely, A non-Univ student😊"
    },
    {
      "postId": "940536471410207",
      "text": "to the person coughing (more like barking) in univ library pls just work in your room i have an essay due"
    },
    {
      "postId": "940026601461194",
      "text": "Just took a shit in the univ shower lol"
    },
    {
      "postId": "936634838467037",
      "text": "SP @Univ thanks for letting me borrow your Lamborghini"
    },
    {
      "postId": "935941561869698",
      "text": "Oxhate to the guy in the Univ library burping, shaking his bottle really loudly and playing music at such volume through your headphones we can all hear it. It’s disgusting and disrespectful behaviour - actually grow up."
    },
    {
      "postId": "932017895595398",
      "text": "oxlove to univ master for spiking the punch for international day and allowing me to get drunk at 1pm"
    },
    {
      "postId": "927064066090781",
      "text": "#oxfess28765 RJ @univ Date sometime? You’re kinda really hot ;)"
    },
    {
      "postId": "927057982758056",
      "text": "We at The Oxymoron are looking for a new generation of writers. If you’re interested in contributing to the University’s least unnecessary paper drop an email to oxonsatire@gmail.com"
    },
    {
      "postId": "925646626232525",
      "text": "My degree has taught me that the lowest temperature you can get to is -273C, but I’ve now found this out to be wrong as my room is -312C. @univ can we get that radiator you promised last term or is the accommodation situation so bad I am actually living in a walk in fridge?"
    }
  ],
  "Magdalen": [
    {
      "postId": "1064116772385509",
      "text": "as the most humble magdalenite, my idea of a standup comedy show is anyone trying to convince me their college is better than mine"
    },
    {
      "postId": "1043051647825355",
      "text": "My Shot"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1033943415402845",
      "text": "OXLOVE to magd JCR brunch. 50 different types of Taylor’s sandwiches?! For FREE?! Tray bakes were the cherry on top"
    },
    {
      "postId": "1032352848895235",
      "text": "guy who studied divinity at oxford and can't stop calling her Mary Mawdlen for the rest of his life. All the other clergymen make fun of him but he can't help it."
    },
    {
      "postId": "1030225422441311",
      "text": "I cried on Magdalen bridge on the way home."
    },
    {
      "postId": "1024752389655281",
      "text": "I get a thrill from nearly getting run over on my bike on magdalen roundabout. Am I james spader from crash? Hell yes"
    },
    {
      "postId": "1022500036547183",
      "text": "Admins please post something about magdalen welfare neglecting college especially finalists. I just want my care package :( why sign up for a role you’re not going to do?"
    },
    {
      "postId": "1022495993214254",
      "text": "oxhate to whoever at the Magdalen bop knocked me off the platform giving me a black eye, 3 days before a date! I look like a damn panda"
    },
    {
      "postId": "1020507273413126",
      "text": "oxhate to the false widows infesting magdalen"
    },
    {
      "postId": "1014944133969440",
      "text": "Plum"
    },
    {
      "postId": "1013454364118417",
      "text": "WS@Magdalen you are clearly a talented person and you seem like a wonderful person - but, respectfully, are you single? And, possibly, into girls?"
    },
    {
      "postId": "1009596397837547",
      "text": "oxlove to NK @ magd…ur the only glink user that i fw ❤️"
    },
    {
      "postId": "1004797324984121",
      "text": "Oxlove to the girl who came up and asked for a lil puff of the joint on Friday eve on Magdalen bridge, you’re v v cool, you gotta join for the next smoke up"
    },
    {
      "postId": "998022688994918",
      "text": "The big three are magdalen, christ church and st hilda’s."
    },
    {
      "postId": "995952745868579",
      "text": "No Magdalen daybreak serenade is a shame, But hey your proctors are to blame."
    },
    {
      "postId": "987996199997567",
      "text": "oxlove to MG@Magd your mini mentorships are incredible and you’re a godsend"
    },
    {
      "postId": "979572247506629",
      "text": "Park Lane: Magdalen"
    },
    {
      "postId": "964127402384447",
      "text": "Oxlove to magd college choir, you guys absolutely raised the roof at choir football <3"
    },
    {
      "postId": "958413129622541",
      "text": "Oxplease can whoever took my navy suit jacket after the Magdalen bop last week return it to the porters #cryingandscreaming"
    },
    {
      "postId": "955798383217349",
      "text": "never thought i’d be doing this but someone drop the @ of the life drawing model @magd…"
    },
    {
      "postId": "953394220124432",
      "text": "oxlove to ATJ@magd- galentines was amazing, best women*’s officer ever! 🥰🥰🥰🥰"
    },
    {
      "postId": "952392603557927",
      "text": "I have been here four years, been to about every Oxford event ever (think two commem balls) and nothing measured up to the Magdalen MCR comedy night. The funniest night ever. Thank you MM@Magd for organising, and CD@Magd you are an absolute LEGEND and I hope to see more of your stuff! So incredibly funny"
    },
    {
      "postId": "949252160538638",
      "text": "Ox love to AO @ magd for a funny speech last night!!"
    },
    {
      "postId": "945671327563388",
      "text": "Oxhate to people who hate on Magd old entz. Their bops were iconic. Stop the hate."
    },
    {
      "postId": "943030437827477",
      "text": "@magd oxwtf your bops have been on point until I invite people and you suddenly drop the ball L"
    },
    {
      "postId": "942279244569263",
      "text": "To the raven haired beauty sitting at the head of the table at Magd guest night…you captured my <3"
    },
    {
      "postId": "941444251319429",
      "text": "oxhate to magdalen holding halfway hall on 14/2. Are you actually dumb"
    },
    {
      "postId": "940024214794766",
      "text": "Oxlove to the new magdalen entz for back to back bop theme bangers, keep it up chaps"
    },
    {
      "postId": "939928918137629",
      "text": "Oxhate to Magdalen tescos not having Polish Bakery bread anymore. I just wanted some yummy kanapeczki 🥲"
    },
    {
      "postId": "932868695510318",
      "text": "oxlove to the magdalen entz team, bop went hard last night"
    },
    {
      "postId": "932017162262138",
      "text": "oxhate to magd’s biggest tiktok bnoc for causing a major mouse infestation w his unsanitary kitchen. why are posh boys not housetrained"
    },
    {
      "postId": "932014825595705",
      "text": "OxWho the fuck do I have to blow to get a drink in Magdalen bar? Worst bar service"
    },
    {
      "postId": "929712785825909",
      "text": "pls drop ur hot girl walk routes guys i will actually die of boredom if i just go to magdalen and back again"
    },
    {
      "postId": "929712115825976",
      "text": "Dear new Magdalen welfare team, Pls get more non-meat pizzas for the next bop"
    },
    {
      "postId": "927062022757652",
      "text": "HS@Magd, been over 4 terms and still I’d die for you"
    }
  ],
  "St Hilda's": [
    {
      "postId": "1064115399052313",
      "text": "Whoever is responsible for Hilda’s stash when we get back, can you please signpost the stash drops better? I’ve missed all of them for the past 2 years :(  am I missing a fb page or smthn?"
    },
    {
      "postId": "1043051647825355",
      "text": "Take a Break"
    },
    {
      "postId": "1027728316024355",
      "text": "IF ANYONE KNOWS ANYONE WHO HAS PICKED UP A HILDAS PUFFER IN ATIK PLEASE PLEASE PLEASE MAKE YOURSELF KNOWN I’M ACTUALLY BEGGING OLEASE"
    },
    {
      "postId": "1024138103050043",
      "text": "Oxhate to St Hilda's welfare reps for still not accepting my follow request after 6 months."
    },
    {
      "postId": "1014944133969440",
      "text": "Blackberry"
    },
    {
      "postId": "1005602508236936",
      "text": "Oxlove to Hilda’s 2nd year JN at the ball. You were drunk AF but are so fit and nice to talk to 😶😶"
    },
    {
      "postId": "1001925265271327",
      "text": "Which balls are happening this term Univ, Hilda’s, Pembroke, Teddy, who have I missed..?"
    },
    {
      "postId": "998022688994918",
      "text": "The big three are magdalen, christ church and st hilda’s."
    },
    {
      "postId": "991343936329460",
      "text": "4: St Hilda’s! the logo is a shock to the senses and a frightful sight. 0/10 will cross the road every time"
    },
    {
      "postId": "988248243305696",
      "text": "Hilda's men"
    },
    {
      "postId": "981892237274630",
      "text": "Does anyone know anything about Hilda’s MCR? Have been pooled there for my Masters, not sure how I’m supposed to feel :S"
    },
    {
      "postId": "967095218754332",
      "text": "TAA@Hilda's, coffee sometimes?"
    },
    {
      "postId": "964129585717562",
      "text": "Oxlol to Hilda’s entz not being at their own bop, I apply the same effort to my degree"
    },
    {
      "postId": "945662544230933",
      "text": "Whoever it is in Hall building @Hilda's that spends about 30 minutes every night doing what sounds like a complete rearrangement of your furniture, reckon you could cut it out and have a bit of respect for everyone else who prefers to sleep at 1 in the morning?"
    },
    {
      "postId": "924936369636884",
      "text": "#oxfess28717 \n#oxlove to Hilda’s ball committee for organising a battle of the bands for a student band to play at the ball!"
    }
  ],
  "St Edmund Hall": [
    {
      "postId": "1062684279195425",
      "text": "Teddy has been going down in relevant colleges rankings lately. But our new Aularian Prime Minister Keir Starmer will make Teddy relevant again!\n\nFloreat Aula!\n(May the Hall Flourish)"
    },
    {
      "postId": "1059727696157750",
      "text": "Oxlove to teddy hall for producing Sir Kier Starmer. Long live the hall. Floreat aula"
    },
    {
      "postId": "1043051647825355",
      "text": "Guns and Ships"
    },
    {
      "postId": "1026982076098979",
      "text": "Oxwhy did the SEH environment rep break into my room and switch my fairy lights off. Not on."
    },
    {
      "postId": "1007263128070874",
      "text": "OXLOVE to wine tasting at teddy hall ball 🔥🔥"
    },
    {
      "postId": "1001925265271327",
      "text": "Which balls are happening this term Univ, Hilda’s, Pembroke, Teddy, who have I missed..?"
    },
    {
      "postId": "991058593024661",
      "text": "Oxlove to the teddy hall boy downstairs rad cam who was making eye contact with me earlier ;))) hmu"
    },
    {
      "postId": "970372785093242",
      "text": "Oxwhich fresher fucked up the library use for everyone at seh"
    },
    {
      "postId": "965504775580043",
      "text": "I can no longer attend Teddy Hall Ball criessssss, and refund deadline passed. Are we allowed to sell tickets please? Im rather worried"
    },
    {
      "postId": "961524779311376",
      "text": "please comment or leave in Teddy Hall plodge if you have them £50 reward"
    },
    {
      "postId": "961264216004099",
      "text": "Oxlove to the goalie that lost teddy hall cuppers - I thought u were cute atleast"
    },
    {
      "postId": "957678013029386",
      "text": "#oxfess29610 #oxsorry to the blokes of Teddy hall for creating the ban of alcohol in cuppers final."
    },
    {
      "postId": "956995956430925",
      "text": "Oxsorry in advance for how Teddy Hall will be at cuppers final…"
    },
    {
      "postId": "947692837361237",
      "text": "AB at teddy hall has the biggest batty of the entire JCR"
    },
    {
      "postId": "945035127627008",
      "text": "AFTER OXSH*G NEARLY BRIKE THE UNI AND TEDDY HALL GOT QUARANTINED - WHY WOULD WE DO THIS AGAIN?"
    },
    {
      "postId": "944211044376083",
      "text": "I’m slightly tipsy right now but I really miss my Teddy Hall ex. He treated me kind of badly but he’s the best thing that ever happened to me. I miss him. It’s embarrassing."
    },
    {
      "postId": "927759722687882",
      "text": "SJB @ SEH i love you and your crosswords but please what is the clue for 18 down i am so desperate (we've finished it otherwise) thank you"
    }
  ],
  "St Catherine's": [
    {
      "postId": "1062679099195943",
      "text": "Apparently the new government is interested in building on the grey belt. Betta watch out St Catz 🛑✋"
    },
    {
      "postId": "1053464046784115",
      "text": "In every successful inter-college relationship there's always the one who lives in the luxurious rich college accommodation with the double bed and en suite and the one who lives in catz with a 3/4 size bed and a tent for a kitchen 😍"
    },
    {
      "postId": "1043051647825355",
      "text": "The Election of 1800"
    },
    {
      "postId": "1037455598384960",
      "text": "OXLove to FM @ Catz. Made my degree so worthwhile and am so glad to have met you! Your smile lights me up and I’m so glad to have crossed paths with you!!"
    },
    {
      "postId": "1014944133969440",
      "text": "Blackcurrent"
    },
    {
      "postId": "1002520685211785",
      "text": "There are too many normal, sane people at St Catz, which makes it awful for hacking purposes"
    },
    {
      "postId": "998017968995390",
      "text": "Oxrespect to IO’R for doing Latin on Duolingo IN THE MIDDLE OF A CATZ BOP - most Oxford thing I’ve ever seen"
    },
    {
      "postId": "994067569390430",
      "text": "#oxfess30418 \nbabe wake up a new catz bar just dropped !!"
    },
    {
      "postId": "991343936329460",
      "text": "3: the st catz cult (what are you hiding in that tent??)"
    },
    {
      "postId": "985868900210297",
      "text": "History students - I feel your pain, really I do, but PLEASE LET ME INTO THE RADCAM I NEED A PRETTY LIBRARY. Sincerely, a concerned Catz English student xxx"
    },
    {
      "postId": "979572247506629",
      "text": "Pentonville Road: St Catz"
    },
    {
      "postId": "978029547660899",
      "text": "So do the St Catz football team just have unlimited spending through embezzling college funds??"
    },
    {
      "postId": "972209301576257",
      "text": "oxlove to the cute guy with the fluffy hair in the catz puffer in windlesham 😍"
    },
    {
      "postId": "971460261651161",
      "text": "Why is there a group of catz freshers wandering around paramaribo in puffers??? Thought I could at least get some break from this here😭😒"
    },
    {
      "postId": "970369978426856",
      "text": "oxHATE to the THIEF who stole my mango loco monster from the st catz laundry room vending machine when I turned away for one minute. I am doing a take home exam this is cruel."
    },
    {
      "postId": "955801386550382",
      "text": "oxsorry to whoever at catz tried to use the far washing machine and then didn’t press start but thank you for the free wash i hope karma does you a massive favour some time soon xx"
    },
    {
      "postId": "951067733690414",
      "text": "#oxfess29441 #oxhate to being able to hear my neighbour at catz watch andrew tate through the thin walls"
    },
    {
      "postId": "946061704191017",
      "text": "Imagine being at Catz and the room you have your half way hall in looks like a conservatory"
    },
    {
      "postId": "944459944351193",
      "text": "This post brought to you by the St Catz gang"
    },
    {
      "postId": "943746814422506",
      "text": "the arne jacobsen chairs at catz may be worth £500, but are they also uncomfortable as fuck and make me never want to study at my desk? yes <3"
    },
    {
      "postId": "939927734804414",
      "text": "Are all porters men?? Or is it just Catz being weird???"
    },
    {
      "postId": "931116792352175",
      "text": "massive oxbooo to catz turning off heating at night so that i have to sleep in my puffer"
    },
    {
      "postId": "927060466091141",
      "text": "Oxwhy to the rotund white porter at Catz. You have the world's easiest job, and yet you still choose to be the most unhelpful human being known to man. Never in my life have I encountered someone with more distain for the human condition than you. If you hate us so much, just leave the job, please. Your colleagues are so nice and helpful in comparison. If you're going to treat us like we're not human, just leave. It's the best for all of us."
    }
  ],
  "New College": [
    {
      "postId": "1062678079196045",
      "text": "New College boys, please shower more"
    },
    {
      "postId": "1050988533698333",
      "text": "Just overheard on another continent that AJ@new and HG@brookes love Albanians and latinas respectively"
    },
    {
      "postId": "1043051647825355",
      "text": "The World Was Wide Enough"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1037149178415602",
      "text": "The RO who disqualified EOM is the same RO who suppressed the no confidence motion when the Ex-President New College brought the Israeli Ambassador two terms in a row."
    },
    {
      "postId": "1036358241828029",
      "text": "The Ex-President from New College has had his hand in encouraging if not leading every attempted and successful removal of EVERY BAME UNION PRESIDENT in oxford."
    },
    {
      "postId": "1033940652069788",
      "text": "Oxhate to 'The Logic Manual' by VH @New"
    },
    {
      "postId": "1020635083400345",
      "text": "Oxlove to the cute girl from new that was in the radcam this morning"
    },
    {
      "postId": "1014944133969440",
      "text": "Mango"
    },
    {
      "postId": "1013787277418459",
      "text": "A slight glimpse of sun and New College third years are walking around topless. God help us."
    },
    {
      "postId": "1005601391570381",
      "text": "oxlove to sisters of funk at new college boat party!! you guys were amazinggg 💕💕"
    },
    {
      "postId": "982541330543054",
      "text": "Postgrads at New!! Is college grad accommodation good or would you recommend living out?"
    },
    {
      "postId": "979572247506629",
      "text": "Bond Street: New"
    },
    {
      "postId": "971462458317608",
      "text": "Please settle a debate between me and my boyfriend. Is the NC buttery called a 'buttery' because food is supplied by The Buttery Hotel, or because that's the word for a cellar-like room?"
    },
    {
      "postId": "951523096978211",
      "text": "Oxlove to NC entz for such a great bop!! You guys are brilliant ❤️❤️"
    },
    {
      "postId": "951068143690373",
      "text": "oxlove to garfunkel at new college bop!!!! you guys sound so amazing ❤️"
    },
    {
      "postId": "947695694027618",
      "text": "Oxlove to EC @NC (ergonomic chair)"
    },
    {
      "postId": "934237268706794",
      "text": "oxlove to PG @new!!"
    }
  ],
  "Oriel": [
    {
      "postId": "1055480779915775",
      "text": "Now that I have finished my degree, looking back, the thing I will miss most is Oriel's pie tuesdays. The lamb and mint was glorious😔😔"
    },
    {
      "postId": "1043051647825355",
      "text": "What Comes Next (slander)"
    },
    {
      "postId": "1035289285268258",
      "text": "Not people in Oriel complaining about funding a play, get a life and let people enjoy things"
    },
    {
      "postId": "1014944133969440",
      "text": "Prune"
    },
    {
      "postId": "1013789340751586",
      "text": "To the aussie oriel boy from the oxford tube (08/05)- tell me more about Sydney sometime?"
    },
    {
      "postId": "1009594947837692",
      "text": "Oriel has never produced fruit quite so sweet as you. Wow."
    },
    {
      "postId": "979572247506629",
      "text": "Trafalgar Square: Oriel"
    },
    {
      "postId": "972959408167913",
      "text": "The only thing that I will miss over the vac is Oriel's pie tuesdays 😢😢😢 Pie, mash and mushy peas is just not the same at home 😔"
    },
    {
      "postId": "968370851960102",
      "text": "oxlove to the oriel guy we met at the kebab van last night and oxsorry for taking the mick out of your poshness"
    },
    {
      "postId": "937613068369214",
      "text": "Oxlove to the band in the oriel jcr post halfway hall, sorry I kept on asking for Free Bird"
    }
  ],
  "Christ Church": [
    {
      "postId": "1054113703385816",
      "text": "Oxhate to Christchurch porters who wouldn’t let us go through college as a shortcut whilst carrying 20kg of food for a food bank </3"
    },
    {
      "postId": "1051555553641631",
      "text": "whoever it is playing the same chappell roan song in christ church on loop. PLEASE stop. it’s been days"
    },
    {
      "postId": "1043051647825355",
      "text": "Alexander Hamilton (duh)"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1033942552069598",
      "text": "That one chch fresher needs to stop smiling like that ASAP 😂"
    },
    {
      "postId": "1025025142961339",
      "text": "Oxlove to ChCh welfare reps. Free ice cream and massages are really all that's getting me through atm 🥰"
    },
    {
      "postId": "1024143243049529",
      "text": "Oxwhy does chch porter’s lodge smell of meat rn"
    },
    {
      "postId": "1018296133634240",
      "text": "is the new organist at chch single and into guys? asking for a friend"
    },
    {
      "postId": "1014944133969440",
      "text": "Banana"
    },
    {
      "postId": "1007978754665978",
      "text": "Oxhelp I had (protected) sex for the first time, with a chch boy unfortunately, and now I'm convinced I'm having a chch baby and I'm terrified"
    },
    {
      "postId": "1004795744984279",
      "text": "Oxhate to whoever just ran through chch meadows with a max volume speaker at 9:30 in the morning. Wasn’t expecting a built-in alarm."
    },
    {
      "postId": "1001811388616048",
      "text": "Oxlove to chch jcr pres for our rent decrease 🔥🔥🔥🔥 you can decrease my rent any day king 💅"
    },
    {
      "postId": "999830295480824",
      "text": "#oxfess30480 stigmatise battels pt 2 ‼️‼️ try £1,902.98 accommodation fees per term at chch 😭😭"
    },
    {
      "postId": "998022688994918",
      "text": "The big three are magdalen, christ church and st hilda’s."
    },
    {
      "postId": "991343936329460",
      "text": "Tier list of how safe do I feel when I see your puffer walking down the street?\n\n1: Christ CHURCH 💜"
    },
    {
      "postId": "988747229922464",
      "text": "Oxlove to Chch’s Trinity entz reps can’t wait for the chaos 🤞"
    },
    {
      "postId": "985860913544429",
      "text": "Hate to resurrect this but I think Christ church puffer guy is just really neurodivergent"
    },
    {
      "postId": "979572247506629",
      "text": "Oxford Street: Christ Church"
    },
    {
      "postId": "955803949883459",
      "text": "ox-resisting-the-urge not to put Cheetos in the Christ church arts week bathtub art piece"
    },
    {
      "postId": "946709084126279",
      "text": "If The House has million fans, then I'm one of them. If The House has one fan, then I'm THAT ONE. If The House has no fans, that means I'm dead. #Oxlove to The House"
    },
    {
      "postId": "946480280815826",
      "text": "#oxfess29295 #oxlove to the three brasenose second years who walked me back from park end- a very hungover chch fresher"
    },
    {
      "postId": "944969007633620",
      "text": "#oxfess29220 #oxlove to the ChCh JCR Pres <3 would let him do unspeakable things to me"
    },
    {
      "postId": "941231744674013",
      "text": "to the ChCh guy in the sunglasses I danced w in atik last night, sorry it ended so soon and that you hate my college </3 wish I got your name"
    }
  ],
  "Pembroke": [
    {
      "postId": "1053464520117401",
      "text": "ball piccies ????"
    },
    {
      "postId": "1047629427367577",
      "text": "Oxhate to the three girls who skipped the crepe queue at Pembroke - we see you…"
    },
    {
      "postId": "1043051647825355",
      "text": "Right Hand Man"
    },
    {
      "postId": "1035283968602123",
      "text": "EH@Pem, you are so incredibly sweet and gorgeous… i’m so angry at anyone who tries to break your heart because you deserve the world <3"
    },
    {
      "postId": "1035122581951595",
      "text": "oxHATE to Pembroke ball kicking us out of accom and still making us pay for that night’s rent!!!"
    },
    {
      "postId": "1028361692627684",
      "text": "RDS @ Pemb you look super cute in pink please wear it more often 💕"
    },
    {
      "postId": "1021539283309925",
      "text": "SB @ Pemb might have the best fits in all of Ox. so clean every time"
    },
    {
      "postId": "1014944133969440",
      "text": "Apricot"
    },
    {
      "postId": "1002769388520248",
      "text": "I thought the point of the Pembroke ball tickets waiting list was for access, so people couldn’t hike up prices to £450 on resell when not everyone can spend that much - slightly slimey they are now doing it themselves…"
    },
    {
      "postId": "1002521785211675",
      "text": "wtf how are Pembroke charging £450 for a ball ticket in this economy 🤓"
    },
    {
      "postId": "1001925265271327",
      "text": "Which balls are happening this term Univ, Hilda’s, Pembroke, Teddy, who have I missed..?"
    },
    {
      "postId": "1001816305282223",
      "text": "to the GORGEOUS brunette (bob) with glasses in the long light blue dress at pembroke pimms last saturday (was that an american accent i caught?) - you looked absolutely incredible queen"
    },
    {
      "postId": "1001809775282876",
      "text": "oxhate to pembroke battels... £2123 for the cheapest band of accom??? what???"
    },
    {
      "postId": "1000384842092036",
      "text": "Oxhate to the Pembroke freshers who won't stfu in the college library. Go socialise elsewhere!!"
    },
    {
      "postId": "997293849067802",
      "text": "ox EXTRA love to people who sell me pembroke pimms tickets, and ox HATE to people who don’t 😰😰😰"
    },
    {
      "postId": "990337013096819",
      "text": "is there a second release of pembroke pimms tickets ?"
    },
    {
      "postId": "988751116588742",
      "text": "Why is Pembroke ball so badly organised. As a Pembroke student we have had no information at all. If it wasn’t my own college I would be wanting a refund."
    },
    {
      "postId": "986503043480216",
      "text": "oxlove to pembroke for celebrating their 400 year anniversary by cutting scholarship prizes by 75% and discontinuing main funding option for summer internships. looking forward to the 400 to come!"
    },
    {
      "postId": "986498123480708",
      "text": "wouldn't trust pembroke ball committee to run a bath"
    },
    {
      "postId": "979572247506629",
      "text": "Pall Mall: Pembroke"
    },
    {
      "postId": "978878784242642",
      "text": "oxlove to BE@Pemb your jazz hands live rent free in my mind 🙌🤟"
    },
    {
      "postId": "974651631332024",
      "text": "Oxlove to RDS @ Pemb. Your Instagram stories are the highlight of my day. Take me with you next time ⛷️"
    },
    {
      "postId": "948003917330129",
      "text": "oxlove to MN @ pembroke I genuinely can't stop thinking about you please say you like women…"
    },
    {
      "postId": "936067485190439",
      "text": "People are trying to resell Pembroke tickets for £400+, this is why no transfers makes sense"
    },
    {
      "postId": "935965961867258",
      "text": "Pembroke ball committee, the people need name transfers for general release tickets !!"
    },
    {
      "postId": "935365075260680",
      "text": "Ball Committee PLEASE allow name transfers for general release tickets. It’s ridiculous, you should be able to transfer tickets to friends especially as it didn’t say anywhere before tickets released that there were no name transfers."
    },
    {
      "postId": "935363928594128",
      "text": "Pembroke Ball Pres here - please don't buy through OxTickets! We are operating a waitlist and you can apply for a refund if needed. As per our T&Cs buying and/or selling any tickets will render the ticket in question automatically void."
    }
  ],
  "Queen's": [
    {
      "postId": "1053273663469820",
      "text": "OxUnsurprised at Queen’s asking me to pay to store a suitcase in college after breaking my shoulder and not being able to carry it on the train 🙃"
    },
    {
      "postId": "1043051647825355",
      "text": "Helpless"
    },
    {
      "postId": "1033515338778986",
      "text": "Oxhate to the guy at queens who started doing the wordle halfway through making out"
    },
    {
      "postId": "1026183739512146",
      "text": "let queens have pets... my welfare is waning very quickly... please"
    },
    {
      "postId": "1025024509628069",
      "text": "“I might revise to his voice”.  him being Keir Starmer - MP@Q"
    },
    {
      "postId": "1024758242988029",
      "text": "Oxlove to that hottie that fell down the Queen’s steps I think it was me that fell for you 🥵"
    },
    {
      "postId": "1020510146746172",
      "text": "Oxlove to whoever forgot to mute as they opened Clash of Clans in the library @ Q You gave us all a good chuckle"
    },
    {
      "postId": "1014944133969440",
      "text": "Strawberry"
    },
    {
      "postId": "1012000210930499",
      "text": "why are people at queen's so utterly lacking in common decency recently?? takeaway strewn all over the quads, vapes and disgusting old bowls of food in the printer room, the library toilets are always filthy - you should be so ashamed of yourselves lol. so immature and disgusting, like actually"
    },
    {
      "postId": "980428640754323",
      "text": "to the person in queen’s middle library who has been thumping and loudly expressing frustration for the past three days in a row we’re all stressed girl go OUTSIDE and let the rest of us work in peace"
    },
    {
      "postId": "979572247506629",
      "text": "Coventry Street: Queens"
    },
    {
      "postId": "958957572901430",
      "text": "Oxlove to MG@Q, and are you single?"
    },
    {
      "postId": "944624994334688",
      "text": "Oxwhy was Greta at pits and perverts night, a real queen of the people 😍"
    },
    {
      "postId": "935256125271575",
      "text": "whoever keeps leaving the toilet seat up, and doesn’t refill the toilet roll in QC library… do better 😔"
    }
  ],
  "Worcester": [
    {
      "postId": "1051556320308221",
      "text": "oxHATE to the open days why on gods good earth are there 17 year olds anywhere near me. Im paying in limbs to stay in my accom therefore the ECHR states i am ENTITLED to drink rum at 10am on the worcester field with my dostoevsky in PEACE !!!!!!! Get out of my HOUSE"
    },
    {
      "postId": "1043051647825355",
      "text": "Burn (prettiest college + song)"
    },
    {
      "postId": "1026978249432695",
      "text": "Sometimes I wake up and I think to myself - I can't wait to be unconscious again"
    },
    {
      "postId": "1014944133969440",
      "text": "Apple"
    },
    {
      "postId": "1010988947698292",
      "text": "Oxwow to whoever was in a Worcester puffer all night at bnc ball"
    },
    {
      "postId": "979572247506629",
      "text": "Leicester Square: Worcester"
    },
    {
      "postId": "967096238754230",
      "text": "Oxlove to BM@Worc and AT@John's I'm gonna miss having lectures with you <3"
    },
    {
      "postId": "958951542902033",
      "text": "#oxfess29660 #oxlove to AG @ Worc in Pret yesterday… I have a Pret subscription if that could convince you to go out with me sometime???"
    },
    {
      "postId": "949897040474150",
      "text": "Oxhate to whoever pissed in the Earl Building lift in Worcester after midway 🤢"
    }
  ],
  "St Peter's": [
    {
      "postId": "1047421034055083",
      "text": "Oxlove to the anniversary of Malala being turned away from peters bar"
    },
    {
      "postId": "1043051647825355",
      "text": "Laurens Interlude (just makes sense)"
    },
    {
      "postId": "1041040098026510",
      "text": "Came to peters bar to ‘bump into you’ but you weren’t there😤😑. U give me delicious flutters🦋"
    },
    {
      "postId": "1037153508415169",
      "text": "Oxlove to Peter's welfare lead this year, how you have the time to be such a lovely person whilst also doing Chemistry is genuinely beyond me."
    },
    {
      "postId": "1029896312474222",
      "text": "Oxlove to TC@SPC. No person embodies the Peter’s spirit like him"
    },
    {
      "postId": "1024754896321697",
      "text": "Oxwtf to the person African drumming at full volume in the Peter’s laundry room at 7.30am"
    },
    {
      "postId": "1014944133969440",
      "text": "Pineapple"
    },
    {
      "postId": "1014432817353905",
      "text": "BC @Peter’s- you’re gorgeous"
    },
    {
      "postId": "1008950707902116",
      "text": "oxhate to everyone at st peters i have one sided beef with two people at this college and they’ve ruined it for the rest of you"
    },
    {
      "postId": "998623855601468",
      "text": "oxhate to peter’s - first no power, now no kafka??"
    },
    {
      "postId": "964132149050639",
      "text": "Oxwhy is Peter's choir so hot"
    },
    {
      "postId": "960020429461811",
      "text": "Oxlove to the Peter's Powercuts. I love anarchy, I love chaos❤"
    },
    {
      "postId": "960009889462865",
      "text": "#oxhate to St Peter's"
    },
    {
      "postId": "946071210856733",
      "text": "OxHate to the Peter's library for putting the seats inside the alcoves - I just want to get a book from the maths section but someone is there spawncamping it and I am not walking in the 1ft of space behind the chair they're sat in to find the book ☹️"
    },
    {
      "postId": "945043637626157",
      "text": "can RC @ peters do that to me? I’ll vote for you?"
    },
    {
      "postId": "944459351017919",
      "text": "can RC @ peters post more shirtless pics then you have my vote"
    },
    {
      "postId": "944418797688641",
      "text": "The people want a hot SU pres, give the people what they want 🥵🔥RC@Peters"
    },
    {
      "postId": "944215044375683",
      "text": "#oxlove to getting trolleyed at a St Peters/Balliol sexless orgy"
    },
    {
      "postId": "944213041042550",
      "text": "SOOOOO gay for RC@peters (can’t convince me he’s straight😘)"
    },
    {
      "postId": "924939672969887",
      "text": "oxconfused why the price of crosskeys at SPC bar has risen £5 to £8 the last 2 years - cozzy livs may be bad, but 60% inflation??"
    },
    {
      "postId": "924375253026329",
      "text": "#oxfess28708 #oxhate to SPC bar for upping the price of Cross Keys to £8. 💀 I blame the almost decade of reduced prices. DO BETTER SPC!"
    },
    {
      "postId": "922945473169307",
      "text": "oxhate to the freshers in peter’s library who won’t stfu 🫠"
    }
  ],
  "Trinity": [
    {
      "postId": "1045868560876997",
      "text": "OxLove to G&Ds workers for single scoopingly seeing me through trinity with no judgement for the number of ice creams it takes to see a student through summer exams"
    },
    {
      "postId": "1044688890994964",
      "text": "I already miss Trinity term take me BACK"
    },
    {
      "postId": "1043051647825355",
      "text": "Washington on Your Side"
    },
    {
      "postId": "1039741261489727",
      "text": "Trinity vs Balliol bop? Where was Trinity???"
    },
    {
      "postId": "1037589165038270",
      "text": "to be in love in Trinity… lounging around in college gardens, getting tipsy on prosecco and chocolate strawberries, enjoying the sun… i’ve never been happier"
    },
    {
      "postId": "1035283395268847",
      "text": "oxlove to the girl playing Helena in the trinity garden play - most definitely not ugly as a bear 😍😍"
    },
    {
      "postId": "1034853448645175",
      "text": "What’s the opposite to trini-free?\n\n👍 for ‘trini-fighting’\n❤️  for ‘trini-fettered’\n😆 for ‘trini-fed up’\n😢 for ‘trini-fatigued’\n🥰 for ‘I have a better idea’ (please put in the comments!)\n\n(And yes, I know we can have ‘trini-failing’ but let’s try not to be pessimistic)"
    },
    {
      "postId": "1033943808736139",
      "text": "oxlove to midsummer night's dream play at Trinity! so fun to watch, great acting and a great garden play"
    },
    {
      "postId": "1033517772112076",
      "text": "#oxfess31180 Trinitired"
    },
    {
      "postId": "1032350338895486",
      "text": "the joy of trinifree is tempered by the anxiety of waiting for your results without anything you can do to change them"
    },
    {
      "postId": "1032349308895589",
      "text": "Trini-tired 😴😩"
    },
    {
      "postId": "1031043869026133",
      "text": "Will we ever truly be TriniFree?"
    },
    {
      "postId": "1030548419075678",
      "text": "This weather is just not aligning with my trinity fantasy"
    },
    {
      "postId": "1029888712474982",
      "text": "Think they should have a trin scouts ban instead of an entz ban, if i want to study until 3am then sleep until 10 without being woken up by vacuuming, that's my business"
    },
    {
      "postId": "1022497816547405",
      "text": "Many of us are fighting two demons this Trinity. Final exams and homosexual desire."
    },
    {
      "postId": "1020582973405556",
      "text": "EcoTrash is back for its 6th year! Get your eco-friendly trashing equipment (and carnations) delivered to you the same day! Show support for your friends this Trinity and order at www.ecotrash.co.uk 😀🌱💐"
    },
    {
      "postId": "1020510633412790",
      "text": "I want to put down trinity but I don't want to waste a slot if it's so popular and I don't know how the spaces are allocated"
    },
    {
      "postId": "1014946043969249",
      "text": "If you are the black girl with the pixie that was at the october club meeting in HT and is friends with A @ Trin - you're gorgeous."
    },
    {
      "postId": "1014944133969440",
      "text": "Blueberry"
    },
    {
      "postId": "1003358471794673",
      "text": "Academic victim in Trinity"
    },
    {
      "postId": "999826642147856",
      "text": "why does trinity plodge smell like actual feces."
    },
    {
      "postId": "999572822173238",
      "text": "Why tf would anyone wear Tonbridge shorts to Trinity Collections? Like how much more Tory do you want to be?"
    },
    {
      "postId": "998814505582403",
      "text": "I keep seeing the word Trinity and thinking my college is relevant then remember everyone's talking about the term"
    },
    {
      "postId": "998326535631200",
      "text": "Left my vibrator at home Trinity ruined"
    },
    {
      "postId": "997933319003855",
      "text": "manifesting a tipsy trinity..."
    },
    {
      "postId": "997289649068222",
      "text": "This Trinity, I'm preemptively apologising for my library yapping\n\nI know it's exam season - I too need to study. But when my gorgeous friends walk by with their new summer outfits, or God forbid, a stunning new tat or nose ring, I have to stop. I have to fawn. I have to yap.\n\nI always whisper, I promise. And while I don't expect to be immediately forgiven, please understand my situation❤\n\nThank you,\nYour local library yapper✨️"
    },
    {
      "postId": "995947769202410",
      "text": "Oxlove to Trinity. Hilary really takes you to pits of doom every time and then Trinity with her little punting escapades and promises of daylight past 2pm really lifts you out"
    },
    {
      "postId": "995665582563962",
      "text": "TRINITY PSA - it's going to be HOT when you come back this term so please WEAR DEODORANT and WASH your PUFFERS before you get here"
    },
    {
      "postId": "993921786071675",
      "text": "packing for trinity and can’t fit my summer shirts in my suitcase because of all the poppers and magnum condoms :("
    },
    {
      "postId": "992334826230371",
      "text": "hot girl hilary is over, may terrifying girl trinity begin ladies we are terrorising men this term ❤️❤️"
    },
    {
      "postId": "991059693024551",
      "text": "#oxfess30321 What should be on my trinity bucket list?"
    },
    {
      "postId": "989685553161965",
      "text": "If any finalists haven't made a Trinity bucket list yet, what are y'all doing?! Wake up, there are escapades to be had"
    },
    {
      "postId": "988747229922464",
      "text": "Oxlove to Chch’s Trinity entz reps can’t wait for the chaos 🤞"
    },
    {
      "postId": "988745516589302",
      "text": "Finally over the mid male that has been plaguing my thoughts and ready to be young, wild, and trinifree"
    },
    {
      "postId": "980425647421289",
      "text": "any jazz/brass bands looking for players in trinity?"
    },
    {
      "postId": "979572247506629",
      "text": "Strand: Trinity"
    },
    {
      "postId": "975965917867262",
      "text": "praying it grows out by trinity🙏"
    },
    {
      "postId": "961528925977628",
      "text": "Oxlove to everyone at Trinity. That's all. I love the community we have here. 🫶"
    }
  ],
  "Union": [
    {
      "postId": "1044688274328359",
      "text": "if oswald mosley rose from the grave, union mfs would invite him to give a talk and take selfies w/ him, even if they 'disagreed with his views'"
    },
    {
      "postId": "1044515281012325",
      "text": "You know the take home paper is going bad when I had to go to the OXFORD UNION LIBRARY for a book, just fail me now"
    },
    {
      "postId": "1037152175081969",
      "text": "The more I know about this Union drama the more that place disgusts me. EOM they don’t deserve you."
    },
    {
      "postId": "1036988848431635",
      "text": "It’s really gross seeing the ex union president trying to make getting ousted about Palestine.\n\nyou didn’t speak up at all about Palestine when you had a chance to but now that you’ve been kicked out its an Islamophobia issue?"
    },
    {
      "postId": "1036358241828029",
      "text": "It’s a little unfair to turn all the ire regarding union r*cism on just RO world. Hacks are just as bad, if not worse. The whole place is rotten. Silence of other ex presidents and officers who know the place is rotten and cannot even pretend to show solidarity proves the point."
    },
    {
      "postId": "1035473961916457",
      "text": "the people exploiting what's happening at the union are not the ones sharing solutions for these problems, but rather those who've made soundbites out if them"
    },
    {
      "postId": "1035282965268890",
      "text": "Appalled at hacks posting about the Union's racist history when it suits them rather than when it truly mattered. Not once did you speak up in meetings but you'll post an empty worded statement now..."
    },
    {
      "postId": "1035280835269103",
      "text": "oxpleaseee can someone expand on the union drama from someone who doesn't know what's happening and is nosy af"
    },
    {
      "postId": "1035277335269453",
      "text": "There is nothing worse than being performative and exploiting the Union's stance on racism. The librarian, as a sitting officer, failed to say a single word during the four-hour meeting and is now exploiting the situation to gain votes. Someone tell her people can see. Shameful!"
    },
    {
      "postId": "1034847165312470",
      "text": "WTF is wrong with union boys using Daddy’s money to threaten their political opponents with lawsuits"
    },
    {
      "postId": "1033940302069823",
      "text": "Guy in the union with a long history of racism says something horrendously islamaphobic in public? Whatttt"
    },
    {
      "postId": "1033934948737025",
      "text": "Everyone KNOWS who the Union racists are but they've literally put a gagging order on naming people"
    },
    {
      "postId": "1033934488737071",
      "text": "Suggesting that anyone who wants to know who the union clerk is who the cherwell identified as islamophobic goes to the public union noticeboard and sees who the tribunal declaration was posted by"
    },
    {
      "postId": "1033933312070522",
      "text": "The press have been banned from reporting his name but the noticeboard in the Union is public record and the clerk is listed on there!"
    },
    {
      "postId": "1033681455429041",
      "text": "Remove the racist bigots from the union NOW, we stand with you EOM"
    },
    {
      "postId": "1022191749911345",
      "text": "I guess this is an actual confession but after 2 years, I am beginning to like the Oxford union. So I will send an oxlove to it. My new found admiration of the union has been the realisation that during the day it can be a quieter place to sit as it has benches and there are trees for shade. It also has a small library and bathrooms. Therefore, for the use of these facilities and the small comforts they give me, membership is wasn’t a waste of money. I don’t need to speak to anyone, or have a wish to go to any kind of events held there, but I like the trees outside."
    },
    {
      "postId": "1000193528777834",
      "text": "Turn the Union into a spoons"
    },
    {
      "postId": "999825928814594",
      "text": "Peak Union this, Peak Union that, just admit you've no morals and then nothing anyone does will surprise you anymore"
    },
    {
      "postId": "998365562293964",
      "text": "Thanking the guy who locked your binned predecessor in a room, then campaigned against her, is next level union."
    },
    {
      "postId": "991766229620564",
      "text": "like if you would go to see the tiktok rizz party leader and turkish quandale dingle at the union im a seccie with a personal connection"
    },
    {
      "postId": "990640306399823",
      "text": "#oxfess30334 Oxlove to union twinks"
    },
    {
      "postId": "976796801117507",
      "text": "not the Student Union and the Union in back to back drama like this uni is not even real"
    },
    {
      "postId": "975160731281114",
      "text": "Oxfess not posting recent union related drama content is deffo evidence of its decline"
    },
    {
      "postId": "968375085293012",
      "text": "Does the next president of the Oxford union have a gf?? Hes so hot 🙏"
    },
    {
      "postId": "964414582355729",
      "text": "I was so pissed at union hacks that I ranked everyone else in order from 1-15 then put this guy at 16. Pls be less annoying"
    },
    {
      "postId": "963483122448875",
      "text": "tried vibes-based voting at the union yesterday but all your auras were abysmal, I had to RON everything. please fix your auras, i recommend amethyst :)"
    },
    {
      "postId": "962177502579437",
      "text": "Started my day by getting texts from two union/conservative soc girlfriends asking to vote for their bf 😊"
    },
    {
      "postId": "961194606011060",
      "text": "is Taylor Swift going to endorse anyone in the oxford union election"
    },
    {
      "postId": "959261739537680",
      "text": "#oxfess29679 invalidating 20+ union candidates??? is this putin’s russia???"
    },
    {
      "postId": "952042860259568",
      "text": "oxlove to the people in union bar that start drinking at 2pm. idk how u do it but i’m impressed w ur stamina"
    },
    {
      "postId": "949900330473821",
      "text": "as someone with quite literally zero knowledge of the union: can someone explain in the simplest terms possible what is happening here. thanks!🤝🏼"
    },
    {
      "postId": "949895480474306",
      "text": "oxhate to the people who shit on the union and then become members or try and get in to see the talks! no one cares that you dislike it, the hypocrisy goes crazy"
    },
    {
      "postId": "949599823837205",
      "text": "#oxfess29408 LB stop the steal, we will all help you storm the union"
    },
    {
      "postId": "949345340529320",
      "text": "In full seriousness, someone explain what’s happening at the Union please :)"
    },
    {
      "postId": "949307127199808",
      "text": "removed pres elect wow"
    },
    {
      "postId": "949299913867196",
      "text": "🚨🚨🚨 THE ELECTION DENYING UNION “PRES” HAS BEEN REMOVED 🚨🚨🚨"
    },
    {
      "postId": "948326750631179",
      "text": "Shark son or union hack daughter?"
    },
    {
      "postId": "946767444120443",
      "text": "Enough of this SU bullshit let’s get back to talking about how the oxford union dipshits stole the election"
    },
    {
      "postId": "945663024230885",
      "text": "why is the creator of oxsh*g on union appointed committee"
    },
    {
      "postId": "944968530967001",
      "text": "What was the union Dominic Cummings photographer thinking? He either looks like he’s high, dying, concussed, or you don’t know how to take photographs. Or all of the above..."
    },
    {
      "postId": "944626424334545",
      "text": "If EP doesn’t win SU prez they should be made oxford union president"
    },
    {
      "postId": "944625794334608",
      "text": "omg it’s iconic you glued yourself to the union floor but it’s even more iconic to see you running for SU prez good luck bestie xx"
    },
    {
      "postId": "943745561089298",
      "text": "To the girl knitting in the backrows at the UN Union debate last Thursday. Drinks some time?"
    },
    {
      "postId": "943528724444315",
      "text": "Oxhate to the privileged Union hacks going to the Crankstart Ball!!"
    },
    {
      "postId": "941444584652729",
      "text": "o wow to walking into the union bar and having them just reach straight for the jameson before i've even ordered"
    },
    {
      "postId": "936678598462661",
      "text": "is there a union lib s*x appreciation society. it’s just the way he reads books to me 🥹"
    },
    {
      "postId": "936628155134372",
      "text": "does anyone else keep getting friend requests from randos in the union or is it just me 🤢"
    },
    {
      "postId": "936626528467868",
      "text": "union lib eom why do you do this to me… you’re driving me CRAZY"
    },
    {
      "postId": "935964541867400",
      "text": "union lib you’re driving me crazy rn - stop being so hot and cold"
    },
    {
      "postId": "935364271927427",
      "text": "Oxlove to the Union Librarian, your speech made me cry a little"
    },
    {
      "postId": "932020235595164",
      "text": "To all the ones at the Union debate last night. THE FACTS HAVE SPOKEN, FOR THEMSELVES"
    },
    {
      "postId": "932007582263096",
      "text": "Oxhelp - what balls/black tie events (other than the union ball) are on this term that I can bring my parents to?"
    }
  ],
  "St John's": [
    {
      "postId": "1044280994369087",
      "text": "contemplating the James Maynard portrait in the SJC hall before I fail my linear algebra paper 😞😞 ive failed you my king"
    },
    {
      "postId": "1043051647825355",
      "text": "Non Stop (paid for the longest song)"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1036916318438888",
      "text": "Oxlove to the John's VP. She's such a calm, stable presence and shows true leadership"
    },
    {
      "postId": "1031251619005358",
      "text": "If Johns can have the L&F, surely one of the colleges can fund a chippy?"
    },
    {
      "postId": "1014944133969440",
      "text": "Pear"
    },
    {
      "postId": "984962693634251",
      "text": "Some serious embezzlement issues in John's 😶 A second dessert here, a casino night there..."
    },
    {
      "postId": "979572247506629",
      "text": "Regent Street: St John’s"
    },
    {
      "postId": "967096238754230",
      "text": "Oxlove to BM@Worc and AT@John's I'm gonna miss having lectures with you <3"
    },
    {
      "postId": "964413552355832",
      "text": "Oxhate to the three (or so) men outside Tommy White St John's screaming their lungs out nearly every night without fail at 1 am"
    },
    {
      "postId": "961269082670279",
      "text": "just bought a vibrator with my college academic grant money thank u sjc"
    },
    {
      "postId": "954054046725116",
      "text": "i’m all for the rehabilitation of sjc- canterbury quad was a gift from god"
    },
    {
      "postId": "938814808249040",
      "text": "Where did johns’ sex appreciation society go?"
    },
    {
      "postId": "937611755036012",
      "text": "oxhate to SJC having potato blight for some reason? it's 1845 all over again"
    },
    {
      "postId": "937606998369821",
      "text": "oxlove to the SJC meatgrinder"
    },
    {
      "postId": "930588172405037",
      "text": "johns 2nd + 3rd years screaming after midnight under tommy white every weekday"
    },
    {
      "postId": "927759722687882",
      "text": "SJB @ SEH i love you and your crosswords but please what is the clue for 18 down i am so desperate (we've finished it otherwise) thank you"
    }
  ],
  "Balliol": [
    {
      "postId": "1043051647825355",
      "text": "Wait for It"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1039741261489727",
      "text": "Trinity vs Balliol bop? Where was Trinity???"
    },
    {
      "postId": "1038455691618284",
      "text": "Oxlove balliol for their bops. Hope there is another one this term 🤞🤞🤞"
    },
    {
      "postId": "1032344195562767",
      "text": "Oxhate to balliol side gate being closed at weekends"
    },
    {
      "postId": "1027726599357860",
      "text": "Overheard at Balliol: if I were to die today and they digged me up in 10 Tsd years, they would think I was a priestess from all the gold I am wearing"
    },
    {
      "postId": "1026982896098897",
      "text": "oxlove to the tall brown haired guy in the stripy shirt i saw at the open mic at balliol please have all of my children"
    },
    {
      "postId": "1026555526141634",
      "text": "Oxwhy is everyone at Balliol so hot?"
    },
    {
      "postId": "1014944133969440",
      "text": "Fig"
    },
    {
      "postId": "1011996650930855",
      "text": "Oxlove to Rough Edge at Balliol Garden party. Especially the trombones, you guys sounded sooooo good ❤️"
    },
    {
      "postId": "1011993774264476",
      "text": "Huge OXLOVE to Balliol Garden Party🪩🪩 had the best time ever!!"
    },
    {
      "postId": "1003234978473689",
      "text": "Massive Oxlove to 93% ball. Had the best night and so much love to the caricaturist for capturing my best side"
    },
    {
      "postId": "1003232571807263",
      "text": "massive oxhate to balliol night porter - prick"
    },
    {
      "postId": "1002767415187112",
      "text": "Bring back musicals night at bully you cowards I need it in my life"
    },
    {
      "postId": "1002519541878566",
      "text": "ANYONE SELLING A BALLIOL GARDEN PARTY TICKET?????"
    },
    {
      "postId": "979572247506629",
      "text": "Whitehall: Balliol"
    },
    {
      "postId": "972214568242397",
      "text": "oxwhat to the person with the balliol puffer by New Walk yesterday (Wednesday) I thought I was the only one 😲"
    },
    {
      "postId": "961527645977756",
      "text": "The problem with balliolfess wasn’t that it was mean but that it was unbelievably dull"
    },
    {
      "postId": "958574606273060",
      "text": "Oxwtf to balliol entz - why are bops becoming club nights and not just fun, silly ones ??"
    },
    {
      "postId": "958420709621783",
      "text": "CZ(?) @ B you are phenomenal, but are you single"
    },
    {
      "postId": "956765483120639",
      "text": "Can CZ@B please stop using the JCR email list for their own personal projects? That’s what the facebook page is for!!"
    },
    {
      "postId": "951526360311218",
      "text": "Oxhate to Balliol freshers constantly talking in the library, Law lib in college is not a collaborative room please go somewhere else to socialise !!"
    },
    {
      "postId": "951068517023669",
      "text": "Oxthank you to Sofia (forgive me for misspelling) who walked with me to Merton in the rain last night, and to the Merton guy who directed me to Balliol."
    },
    {
      "postId": "948322707298250",
      "text": "Balliol bops have never been so good wtaf that was insane"
    },
    {
      "postId": "946482047482316",
      "text": "oxlove to the girl in the red cowl neck top at Balliol bar- I saw you leaning against the wall but I was too nervous to say hello. I just wanted you to know I think you're really beautiful and hope you get tagged"
    },
    {
      "postId": "945660560897798",
      "text": "oxlove to balliol. that is all."
    },
    {
      "postId": "944967247633796",
      "text": "Oxlove to Halfway Hall at Balliol❤️"
    },
    {
      "postId": "944215044375683",
      "text": "#oxlove to getting trolleyed at a St Peters/Balliol sexless orgy"
    },
    {
      "postId": "944214021042452",
      "text": "#oxlove to the boy in a brown jacket at Balliol last night (03/02/24) telling his clearly wasted friends not to jump into a spiky bush - your motherly exasperation really made my night"
    },
    {
      "postId": "943035017827019",
      "text": "Where’s the girl in the new Balliol accom kitchen who used to study there 24/7 😕 WE MISS YOU SEEING YOU EVERY DAY AT 3AM!"
    },
    {
      "postId": "941232344673953",
      "text": "can someone pls tell me what the Balliol 3 L’s are? Halfway Hall nominations have confused me"
    },
    {
      "postId": "927756952688159",
      "text": "CS @ B i think i've seen you on tinder & ur v cute but also don't think u swing this way?"
    },
    {
      "postId": "924377823026072",
      "text": "Half-Bulgarian second year Mathematician at Balliol, I may or may not have a crush on you."
    }
  ],
  "Brasenose": [
    {
      "postId": "1043051647825355",
      "text": "Yorktown"
    },
    {
      "postId": "1038456514951535",
      "text": "Oxlove to the redhead with cowboy boots walking down Brasenose lane today, your outfit was amazing and I wanted to ask where your dress is from"
    },
    {
      "postId": "1027238669406653",
      "text": "Whoever at Brasenose smudged my mug painting I will find you"
    },
    {
      "postId": "1025421376255049",
      "text": "You walked down Brasenose then Turl street with the girl in the pink blouse."
    },
    {
      "postId": "1015803410550179",
      "text": "Sorry for setting the bnc fire alarm off y'all"
    },
    {
      "postId": "1014944133969440",
      "text": "Orange"
    },
    {
      "postId": "1010988947698292",
      "text": "Oxwow to whoever was in a Worcester puffer all night at bnc ball"
    },
    {
      "postId": "1009594304504423",
      "text": "oxlove to everyone bumping their head at the top of the staircase at bnc library. you are making my day please don't get a concussion"
    },
    {
      "postId": "1008826127914574",
      "text": "Oxlove to the BNC library carpet tripping up an endless stream of people, entertainment enough to see me through this essay"
    },
    {
      "postId": "987443830052804",
      "text": "LT @ Brasenose, idk you but you’re literally one of the most gorgeous people I have ever seen, incredibly jealous and wish I looked like you!!"
    },
    {
      "postId": "979572247506629",
      "text": "Piccadilly : Brasenose"
    },
    {
      "postId": "978029007660953",
      "text": "Oxlove to AE@BNC, #mypresident. Xo, someone cool who totally doesn’t have a crush on you"
    },
    {
      "postId": "975969761200211",
      "text": "The bot comments about balls are great. Thank you Anne, 76 from Surrey, I would love to buy one of your four BNC ball guest tickets."
    },
    {
      "postId": "975156667948187",
      "text": "Is anyone selling a BNC ball ticket? I’ll pay premium for it 🙏"
    },
    {
      "postId": "973906768073177",
      "text": "Does anyone have a BNC ball ticket that can no longer attend? I really want to attend - asking for a friend."
    },
    {
      "postId": "953391200124734",
      "text": "RW@BNC I’m sorry& hope we can still be friends?"
    },
    {
      "postId": "952399230223931",
      "text": "Huge oxlove to BA @BNC for asking our tutor what year we will get our collections back. 💀"
    },
    {
      "postId": "952047563592431",
      "text": "OxLove to SA ES and MG @BNC for the best halfway hall evaaaaa"
    },
    {
      "postId": "946480280815826",
      "text": "#oxfess29295 #oxlove to the three brasenose second years who walked me back from park end- a very hungover chch fresher"
    },
    {
      "postId": "945668357563685",
      "text": "STOP STOMPING UP AND DOWN THE BNC LIBRARY LIKE A HERD OF ELEPHANTS ISTG"
    },
    {
      "postId": "938817344915453",
      "text": "If anyone sees a gold ring with a blue gem centre and white gem crown pls comment!! I think I lost it on Radcliffe square/ in BNC last night!! It’s my mums and she might kill me if I come back home without it😭😭 it’s not valuable, just sentimental, and if u return it I promise I’ll come up with some sort of reward/ I will love u forever 😭"
    },
    {
      "postId": "933525778777943",
      "text": "AP@Bnc, were you born in a hospital or were you forged in the realm of red trousers? Or just born with them on? Or both?"
    }
  ],
  "Corpus Christi": [
    {
      "postId": "1043051647825355",
      "text": "It's Quiet Uptown"
    },
    {
      "postId": "1024750992988754",
      "text": "O love to BM@CCC. Hottest medic hands down."
    },
    {
      "postId": "1015808073883046",
      "text": "to a fight breaking out at a corpus because one guy said another guys girl did a poo in the jcr"
    },
    {
      "postId": "1014944133969440",
      "text": "Tomato"
    },
    {
      "postId": "1010989977698189",
      "text": "Oxlove to corpus band at the ball. First song came on and I lost my mind. Also lead singer. Hot."
    },
    {
      "postId": "1001363948660792",
      "text": "oxwhen is corpus coming out with more ball info"
    },
    {
      "postId": "979572247506629",
      "text": "Euston Road: Corpus Christi"
    },
    {
      "postId": "960432126087308",
      "text": "Oxlove to Corpus. We've been so resilient and we've been so good at looking out for each other, it's made more off a difference than each of us realise. Keep holding on, I promise no one here is alone, there are people out there who are willing to care and help shoulder the trouble if you're willing to reach out."
    },
    {
      "postId": "933513655445822",
      "text": "Oxlove to Welfare at Corpus. Please introduce welfare dog fighting / general welfare blood sports"
    }
  ],
  "Exeter": [
    {
      "postId": "1043051647825355",
      "text": "One Last Time"
    },
    {
      "postId": "1027728859357634",
      "text": "Oxhate to exeter college queue for burgers at summer 8s. I waited an hour. Ppl running it were lovely though"
    },
    {
      "postId": "1016647567132430",
      "text": "oxwhat is in the water at exeter⁉️⁉️ most unholy behaviour in this uni comes from that place"
    },
    {
      "postId": "1014944133969440",
      "text": "Cranberry"
    },
    {
      "postId": "1000388008758386",
      "text": "oxlove to whoever lost their white thong at exeter ball"
    },
    {
      "postId": "1000383485425505",
      "text": "OxADORATION to the medics at Exeter Ball"
    },
    {
      "postId": "979572247506629",
      "text": "Bow Street: Exeter"
    },
    {
      "postId": "977575424372978",
      "text": "her stepson (who had just graduated from exeter) was a good catch"
    },
    {
      "postId": "958953456235175",
      "text": "Just made eye contact with an exeter puffer guy at gatwick. Is there no reprieve from this damned university"
    },
    {
      "postId": "958461986284322",
      "text": "So Exeter entz knows that there have been more halfway hall votes than there are actual students in second year, and yet won’t do another round of voting? They literally know the vote is being rigged, wonder why they don’t care 🤔"
    },
    {
      "postId": "957683286362192",
      "text": "PLEASE find my ID AB @EX lost in bridge queue PLS"
    },
    {
      "postId": "955798926550628",
      "text": "(Presumably) Fresher in Sc14 @ Exeter\n1. Flush your turds\n2. Wipe your ass\n\nSincerely a very tired 4th year xoxoxo"
    },
    {
      "postId": "954901329973721",
      "text": "endless oxlove to the jesus, exeter and lincoln choirs for the beautiful tsaf evensong"
    },
    {
      "postId": "952051996925321",
      "text": "#oxfess29481 #oxlove to the exeter girls who helped get my friend home, legends xx"
    },
    {
      "postId": "934235658706955",
      "text": "just oxhate to exeter. the lot of you. your vibes really give mean entitled and insular ngl"
    },
    {
      "postId": "931109975686190",
      "text": "Exeter football club not inviting the women’s team to the football dinner is so on brand for them x"
    },
    {
      "postId": "922949716502216",
      "text": "can exeter PLS deal with the mould issues in the iffley road houses!!! all 4 houses have significant amounts of mould and the only change they’ve done so far is to add a small dehumidifier box in the bedrooms"
    }
  ],
  "Hertford": [
    {
      "postId": "1043051647825355",
      "text": "History has it eyes on you"
    },
    {
      "postId": "1036912071772646",
      "text": "IM @ Hertford your ginger hair is so pretty,, do you like girls by any chance 🫣"
    },
    {
      "postId": "1014944133969440",
      "text": "Coconut"
    },
    {
      "postId": "1014442520686268",
      "text": "Oxwhat to the people coming in to Hertford and doing a photoshoot with... a carton of eggs? Y'all are iconic but I have to ask, what was going on?"
    },
    {
      "postId": "1009597097837477",
      "text": "oxlove to people at hertford. why do they all have the same goofy vibe i love it"
    },
    {
      "postId": "989588929838294",
      "text": "#oxfess30317 #oxlove to ASW @ hert. always bringing that LA energy"
    },
    {
      "postId": "988250566638797",
      "text": "Oxlove to my dad spotting an Oxford puffer up north, describing the college crest as 'a red wolf thing' and inferring that it was probably a random language school attempting to masquerade as a real Oxford college - turned out to be Hertford"
    },
    {
      "postId": "979572247506629",
      "text": "White Chapel Road: Hertford"
    },
    {
      "postId": "964124639051390",
      "text": "oxapologies to the person in hertford who shouted out of the window for us to shut up @2am!!"
    },
    {
      "postId": "961530469310807",
      "text": "Has anyone picked up a half pearl half chain necklace near hertford, devastated to have lost it since it was a gift!!"
    },
    {
      "postId": "954903996640121",
      "text": "CASB @Hertford who got off their bike to help her, you’re stunning! What a babe."
    },
    {
      "postId": "950052987125222",
      "text": "HOD@hert, you have my heart 🩷"
    }
  ],
  "Jesus": [
    {
      "postId": "1043051647825355",
      "text": "What'd I Miss"
    },
    {
      "postId": "1025421376255049",
      "text": "Please if you’re at Jesus or another college I see who you are."
    },
    {
      "postId": "1014944133969440",
      "text": "Grape"
    },
    {
      "postId": "1003710291759491",
      "text": "Oxhate to the Jesus freshers for thinking they’re too good for the bops. It’s £4 for 7 ridiculously strong drinks, you do not need to pre!"
    },
    {
      "postId": "1002520118545175",
      "text": "Oxhate to the Jesus for not fixing the bike shed. It's been a whole vac, I don't want my wheels stolen 😭"
    },
    {
      "postId": "1001334935330360",
      "text": "everyone talks about oxford men but oxford WOMEN.. JESUS.."
    },
    {
      "postId": "989588366505017",
      "text": "Oxhate to Jesus College, I’ve met one good or nice person from there (oxlove to that one person) xxx"
    },
    {
      "postId": "988125303317990",
      "text": "Sexiest college - Jesus!"
    },
    {
      "postId": "979572247506629",
      "text": "Marlborough Street: Jesus"
    },
    {
      "postId": "965728825557638",
      "text": "you don't need CUREC you need Jesus"
    },
    {
      "postId": "954901329973721",
      "text": "endless oxlove to the jesus, exeter and lincoln choirs for the beautiful tsaf evensong"
    },
    {
      "postId": "943031094494078",
      "text": "oxhate to jesus for having zero spaces left for halfway hall"
    },
    {
      "postId": "942284117902109",
      "text": "now that Lady Gaga is an honorary member of the Jesus JCR she better come to the next bop"
    },
    {
      "postId": "934230178707503",
      "text": "can people please just not talk in the jesus lower meyricke - i love you guys, but when you are constantly having full blown conversations it's pretty hard to work"
    },
    {
      "postId": "929375612526293",
      "text": "I wish I had as much confidence as the people on cornmarket who tell me Jesus loves me"
    }
  ],
  "Keble": [
    {
      "postId": "1043051647825355",
      "text": "Your Obedient Servant"
    },
    {
      "postId": "1035472468583273",
      "text": "the librarian kicking emma watson out of keble lib for not being a keble student is the highlight of my boring boring week"
    },
    {
      "postId": "1034849118645608",
      "text": "The average Keble student, c.1870 to present"
    },
    {
      "postId": "1017491037048083",
      "text": "why didnt they call it ke-ball"
    },
    {
      "postId": "1017488727048314",
      "text": "oxlove to the boys working in the cloakroom at keble ball you made my night💕"
    },
    {
      "postId": "1014944133969440",
      "text": "Lime"
    },
    {
      "postId": "1003530035110850",
      "text": "Oxhate to the shambles that was the nancy pelosi talk at Keble …. Maybe don’t sell tickets to people to then turn them away because you’ve reached capacity?"
    },
    {
      "postId": "991628682967652",
      "text": "Not the Keble housekeeping staff making fun of Muslims fasting for Ramadan thinking that nobody else could understand them speaking in Albanian....."
    },
    {
      "postId": "991059389691248",
      "text": "Call me Keble the way i’m BRICKED UP ‼️🧱😼"
    },
    {
      "postId": "988128909984296",
      "text": "Oxconfused to the girl in a Keble cap at Snowdon today - can’t escape Oxford students"
    },
    {
      "postId": "986495576814296",
      "text": "Keble puffer spotted at brum new st station, really can’t escape Oxford huh"
    },
    {
      "postId": "981055854024935",
      "text": "Been listening to professional recordings of Phantom of the Opera songs made me realise just how absolutely incredible the cast of Phantom @Keble was in W7!"
    },
    {
      "postId": "979572247506629",
      "text": "Northumberland Avenue: Keble"
    },
    {
      "postId": "963486879115166",
      "text": "Oxlove to MA and PM@keble, cutest couple ever !!"
    },
    {
      "postId": "957686933028494",
      "text": "From a waiter at Keble that goes to Bristol, seeing how clueless some of u are whilst simultaneously being some of the biggest brains on the planet makes me chuckle"
    },
    {
      "postId": "947692430694611",
      "text": "Madly in love with JDO at Keble; POBH back off she's mineeeeeee"
    },
    {
      "postId": "943747754422412",
      "text": "the keble ball theme is sooooo gorgeous i’m so excited for a ball with such a good price"
    },
    {
      "postId": "937604085036779",
      "text": "Keble Building 👍 Alright ❤️ Beautiful 😆Horrific Want to see people’s perceptions of this college because everyone I speak to has entirely different opinions on whether or not it’s pretty."
    },
    {
      "postId": "932013082262546",
      "text": "oxlove to GG @ Keble you're the best"
    }
  ],
  "Lincoln": [
    {
      "postId": "1043051647825355",
      "text": "Dear Theodosia (pretty, lesser known)"
    },
    {
      "postId": "1014944133969440",
      "text": "Blood Orange"
    },
    {
      "postId": "998620872268433",
      "text": "i’m emotional writing this but oxlove to SK at lincoln, never known someone to have worked so hard to get where they are now. u deserve so much but are still so humble, i’m sad to see u graduate this year :/ wishing u all the best lucky to know someone so kind 😊"
    },
    {
      "postId": "982541330543054",
      "text": "Sincerely, a Lincoln grad xxx"
    },
    {
      "postId": "979572247506629",
      "text": "Vine Street: Lincoln"
    },
    {
      "postId": "954901329973721",
      "text": "endless oxlove to the jesus, exeter and lincoln choirs for the beautiful tsaf evensong"
    },
    {
      "postId": "949605290503325",
      "text": "Oxlove to the Lincoln JCR pres for an incredible speech at Halfway Hall!!"
    },
    {
      "postId": "948328900630964",
      "text": "Oxlove to the Lincoln College fleece. Need to be swallowed up when hungover? Check. Cold af because the heating isn’t working? Check. Generally a sexy fleece? Check."
    },
    {
      "postId": "933525045444683",
      "text": "Oxlove to the tall guy at buzzgym in a Lincoln tee and glasses, you’re my gym crush x"
    }
  ],
  "Mansfield": [
    {
      "postId": "1043051647825355",
      "text": "Aaron Burr, Sir"
    },
    {
      "postId": "1041757101288143",
      "text": "To the chaplain at Mansfield, Your dog is cute and you are too ❤️"
    },
    {
      "postId": "1014944133969440",
      "text": "Guava"
    },
    {
      "postId": "958955289568325",
      "text": "Oxhate to the two mansfield cunts who pushed in the line at Hassans - I hope you drop your chips xoxox"
    }
  ],
  "Merton": [
    {
      "postId": "1043051647825355",
      "text": "Who Lives who dies (fun)"
    },
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1038461551617698",
      "text": "Oxlove to the cast of the Merton chapel play 🔥🔥🧝🏻‍♂️"
    },
    {
      "postId": "1026183739512146",
      "text": "when are merton gonna stop caring about their stupid dead horse"
    },
    {
      "postId": "1014944133969440",
      "text": "Kiwi"
    },
    {
      "postId": "984955463634974",
      "text": "JT @ Merton I want to vaporise you into mint sauce."
    },
    {
      "postId": "979572247506629",
      "text": "Fleet Street: Merton"
    },
    {
      "postId": "969564491840738",
      "text": "Oxlove to the gaggle of Mertonians in Gatwick airport today - enjoy your “pilgrimage” queens 🥰"
    },
    {
      "postId": "951068517023669",
      "text": "Oxthank you to Sofia (forgive me for misspelling) who walked with me to Merton in the rain last night, and to the Merton guy who directed me to Balliol."
    },
    {
      "postId": "950051950458659",
      "text": "TH @ Merton. You’re sexy asf. You know who this is. Xxx"
    },
    {
      "postId": "948325210631333",
      "text": "Massive oxlove to Merton entz for organising the cutest halfway - SF poem was so cute <3"
    },
    {
      "postId": "935267621937092",
      "text": "Who was the pretty woman in the Merton puffer @ pharmacology this morning 😭"
    }
  ],
  "St Anne's": [
    {
      "postId": "1043051647825355",
      "text": "Stay Alive (reprise)"
    },
    {
      "postId": "1042781657852354",
      "text": "Can whoever sent AB@StA a text-a-chocolate as Mystery person please come forward ‼️"
    },
    {
      "postId": "1036354891828364",
      "text": "OXHATE to St Anne’s Fox for the drive by on the new cat. It’s on sight from here on out 🔪😡☠️🦊"
    },
    {
      "postId": "1033515782112275",
      "text": "OXHATE to the person that designed the St Anne’s puffer to not say Oxford on it! HOW AM I MEANT TO FLEX WHEN I GO BACK TO MY HOMETOWN !!!"
    },
    {
      "postId": "1014944133969440",
      "text": "Honeydew Melon"
    },
    {
      "postId": "1014508764012977",
      "text": "The famous Summertown Tapestry records Old Flappy's defeat at the Battle of Parson's Pleasure, an event widely believed by historians to have made inevitable the victory of the purposeful and bold forces of St Anne's College in the Ball War of 2023."
    },
    {
      "postId": "1006673888129798",
      "text": "To the culty americans on the st annes quad who keep on playing guitar and singing - this is not a hippie commune. Please stop for the love of god"
    },
    {
      "postId": "988127716651082",
      "text": "Oxlove to FP @ Anne’s - genuinely such a gem and force of warmth and light, love seeing u around!"
    },
    {
      "postId": "965730352224152",
      "text": "Oxlove to the librarians at St Anne’s, literally the sweetest and most helpful people"
    },
    {
      "postId": "956269196503601",
      "text": "When will the Anne's freshers grow up and realise that the old library is not one big study room... absolutely shameless, not even trying to whisper"
    },
    {
      "postId": "941238204673367",
      "text": "big big oxlove to the anne's entz for anne's sommers - vibes incarnate and no drama"
    },
    {
      "postId": "935943371869517",
      "text": "Oxlove to AK @ stA. Incredible human being."
    }
  ],
  "Somerville": [
    {
      "postId": "1043051647825355",
      "text": "The Schulyer Sisters"
    },
    {
      "postId": "1039736981490155",
      "text": "Somerville leavers superlatives need some work, here are 10 categories you can have for free: -most unemployed - biggest hack - biggest name dropper - biggest dick - most likely to vote reform - most likely to ask ‘do you know who you dad is’ - biggest simp - most likely to start a fight in bridge - most likely to have regretted oxford - best haircut - worse opinions - rear of the year - worse toff"
    },
    {
      "postId": "1021543439976176",
      "text": "Who IS the guy with glasses strutting round Somerville in checked shirts and the brown belt?! Absolute nerdy fire 🔥"
    },
    {
      "postId": "1014944133969440",
      "text": "Lemon"
    },
    {
      "postId": "1011995037597683",
      "text": "Oxlove to whoever is leaving the little paper birds around Somerville. Really makes my day seeing them!!"
    },
    {
      "postId": "1010484934415360",
      "text": "Oxhate to the people who used the Somerville punt at 2pm on 4th. You were supposed to be back by 4! Left after waiting with friends for 45 minutes…"
    },
    {
      "postId": "1001062872024233",
      "text": "Oxlove to Somerville Library for saying how busy it is on their website!!! All OxLibraries should do this <3"
    },
    {
      "postId": "999567885507065",
      "text": "Law at Somerville is the best. The students and the tutors are all just so nice."
    },
    {
      "postId": "980430557420798",
      "text": "somerville being left out of every single Oxfess college ranking post is my roman empire #uptheville ❤️🖤💔"
    },
    {
      "postId": "963488882448299",
      "text": "Oxweirded out by Somerville fresher patriotism. Think some of you would sell a limb for your college, but I’m so here for it"
    },
    {
      "postId": "962192482577939",
      "text": "Oxlove to somerville for always turning up to Parkers- you guys are real, especially EDW and BF @ Somerville who always bring good vibes"
    },
    {
      "postId": "954897513307436",
      "text": "Oxlove to the Somerville maintenance men I fancy you all, especially the tall mixed guy with the curly hair"
    }
  ],
  "Wadham": [
    {
      "postId": "1043051647825355",
      "text": "Satisfied"
    },
    {
      "postId": "1032345115562675",
      "text": "overheard at Wadham: “so many of us in college are gay that putting the rent up is basically homophobic”"
    },
    {
      "postId": "1020509506746236",
      "text": "if i do badly in my exams im blaming the solitary magpie thats always in wadham"
    },
    {
      "postId": "1019708313493022",
      "text": "Oxwho drew the giant one-balled cocktail outside wadham"
    },
    {
      "postId": "1014944133969440",
      "text": "Cherry"
    },
    {
      "postId": "1007263898070797",
      "text": "Settle a debate:\n❤️ Wadhlove\n👍 Wadlove"
    },
    {
      "postId": "1006674758129711",
      "text": "Okay what in the oxhell, why are there chess pieces all over the Wadham fellows garden lawn??"
    },
    {
      "postId": "1005599958237191",
      "text": "Oxlove to that strawberry hat at Wadstock"
    },
    {
      "postId": "1003712318425955",
      "text": "Oxwhy did I just see a white rabbit go into Wadham?"
    },
    {
      "postId": "997286589068528",
      "text": "Average Wadham student"
    },
    {
      "postId": "991771709620016",
      "text": "What are some bucket list oxford activities? I'm ticking off Wadstock this term but I need MORE"
    },
    {
      "postId": "991622906301563",
      "text": "Was considering Wadstock this year but now I learn tickets went on sale month ago?? Time is not real"
    },
    {
      "postId": "979572247506629",
      "text": "The Angel, Islington: Wadham"
    },
    {
      "postId": "976058721191315",
      "text": "Stop asking for wadstock tickets on oxtickets ur never gonna get them lmaooo"
    },
    {
      "postId": "964129045717616",
      "text": "massive oxlove to my friends (wadh first year 🫶) who not only reassure me when overthinking but never make me feel stupid and treat each worry i have as sincerely as the last. anyone who doesn’t have this, promise your people are out there!"
    },
    {
      "postId": "951528536977667",
      "text": "TB at Wadham hope you enjoyed the 1975 at the o2. Saw your puffer in the cloakroom"
    },
    {
      "postId": "944417261022128",
      "text": "Biggest oxlove to EP @ wadham"
    },
    {
      "postId": "944208667709654",
      "text": "we stan our lord and saviour E(R)P @ wadh"
    },
    {
      "postId": "937725808357940",
      "text": "this is a long shot, but met the FITTEST dphil engineer from wadham at the last Russian soc event and wanted to ask for his number but was in a rush, make yourself known I feel like we could smoke up together sometime x"
    },
    {
      "postId": "935365901927264",
      "text": "Oxlove to JK @Wadham - cute glasses!!"
    }
  ],
  "All Souls": [
    {
      "postId": "1042784611185392",
      "text": "Colleges with the MOST AURA"
    },
    {
      "postId": "1014944133969440",
      "text": "James’ Giant Peach"
    },
    {
      "postId": "979572247506629",
      "text": "Mayfair: All Souls"
    },
    {
      "postId": "956993389764515",
      "text": "the closest i'll get to academic validation is matching with someone from all souls on tinder"
    },
    {
      "postId": "956762656454255",
      "text": "Call me arrogant idrc but I simply do believe All Souls want me. I just know they’re gonna be eating up every word I write on that exam paper"
    },
    {
      "postId": "945665014230686",
      "text": "All the college bar review pages have died… the public needs to know, it’s time to start it back up. Follow @OxfordCollegeBars on Instagram for the info you know you need."
    },
    {
      "postId": "936633535133834",
      "text": "oxlove to the cute boy at alts in the green jacket with brown hair who helped me up when I fell"
    }
  ],
  "OUCA": [
    {
      "postId": "1036988311765022",
      "text": "If you need any help with this case (for which you have my wholehearted compassion), I suggest you contact the women’s officer, and the welfare officer, whose names and email addresses you can find on the Association’s website. OUCA is not a « join at your own risk society » for anyone of any background: I promise you will find support for your concerns, not being a member will not hold you back in any way."
    },
    {
      "postId": "1031252185671968",
      "text": "No Thank You, OUCA! #westandwithsurvivors"
    },
    {
      "postId": "1010995297697657",
      "text": "#oxfess30802 #oxfess30788 society if OUCA didn’t exist"
    },
    {
      "postId": "1010489551081565",
      "text": "society if ouca didn't require suits"
    },
    {
      "postId": "1001919048605282",
      "text": "#oxfess30643 OUCA is embarrassing"
    },
    {
      "postId": "978030117660842",
      "text": "No way did a guy in OUCA use being an incel as a reason to vote for him 😭😭"
    },
    {
      "postId": "949203057210215",
      "text": "what’s the deal with OUCA and turning p&p into p*gging and policy"
    }
  ],
  "St Antony's": [
    {
      "postId": "1033941908736329",
      "text": "oxlove to the student dancers at st anthony’s ball! such a fun act"
    },
    {
      "postId": "983316047132249",
      "text": "how are the vibes at st. antony's?? i'm a current undergrad with a master's offer from there but know nothing about the college"
    },
    {
      "postId": "972963204834200",
      "text": "OMG IS TIMMY C. COMING TO WILLY WONKA BALL @ St.Ants? JOIN MY MANIFESTATION CIRCLE PLEASE\n\n                       🕯\n              🕯             🕯\n        🕯                          🕯\n                   timmy\n    🕯                 @               🕯\n                 st ants ball\n        🕯                          🕯\n              🕯             🕯\n                       🕯"
    },
    {
      "postId": "972210174909503",
      "text": "Why is there a group of st antonys freshers wandering around the international space station in puffers??? Thought I could at least get some break from this here😭😒"
    }
  ],
  "Regent's Park": [
    {
      "postId": "1033938142070039",
      "text": "Hinge advice - do not talk to multiple people from Regents, if you actually end up visiting one you will end up having to fearfully dodge people all night because it's tiny and they all know each other it's terrifying"
    },
    {
      "postId": "1025027069627813",
      "text": "OxBaffled that somebody actually graffitied N*ZI Sw*stikas all over RPC! This is just one of many blatant incidents incase anybody thinks that Jewish students are exaggerating about antisemitism. Reminder that the conflict is not a reason to attack Oxford Jews who have NOTHING TO DO WITH IT. Absolutely disgusted."
    },
    {
      "postId": "1018295653634288",
      "text": "Oxhate to RPC library. You couldn't turn on the radiators during winter but you're more than happy to have them at full blast in the summer."
    },
    {
      "postId": "1014944133969440",
      "text": "Avocado"
    },
    {
      "postId": "964118402385347",
      "text": "so excited for the sister college to come to RPC"
    },
    {
      "postId": "953389933458194",
      "text": "@ RPC"
    }
  ],
  "Reuben": [
    {
      "postId": "1030016932462160",
      "text": "Oxhate to Reuben College occupying half the RSL as a result of which it's always totally full, get your own library"
    },
    {
      "postId": "1014429680687552",
      "text": "Petition to camp out in the rsl in protest to abolish Reuben college and reacquire the rest of our library"
    },
    {
      "postId": "944210237709497",
      "text": "SU President (unofficial) election poll (candidates in alphabetical order) 👍 - Addi ❤️ - Elliot 😯 - Isaac 😢 - Q 😆 - Reuben 🥰 - Shermar 😡 - Tim"
    },
    {
      "postId": "943525771111277",
      "text": "Reuben seems so nice the SU needs nice wholesome people 😃"
    }
  ],
  "Harris Manchester": [
    {
      "postId": "1014944133969440",
      "text": "Nectarine"
    },
    {
      "postId": "1007979341332586",
      "text": "How is Harris Manchester as a college ? Recently heard someone was pushed down the stairs ? Would prefer a peaceful university life , if possible ...."
    }
  ],
  "Green Templeton": [
    {
      "postId": "1014944133969440",
      "text": "Adam and Eve’s devil fruit"
    },
    {
      "postId": "980421487421705",
      "text": "Green Templeton puffer spotted in Hatfield"
    }
  ],
  "Linacre": [
    {
      "postId": "979573070839880",
      "text": "Probably should have skimmed Oxfess before putting Linacre as my first choice because it reminded me of crisps. Is it that bad?"
    },
    {
      "postId": "932873515509836",
      "text": "whats the deal with the \"linacre truth\" website??"
    },
    {
      "postId": "921174406679747",
      "text": "Linacre? More like LITacre! This college is 🔥"
    }
  ],
  "St Cross": [
    {
      "postId": "975159301281257",
      "text": "let me do my old english in peace rather than in the godforsaken st cross building. it’s harder to learn than bloody french that’s for sure"
    }
  ],
  "St Stephen's House": [
    {
      "postId": "953389933458194",
      "text": "Oxlove to SS"
    }
  ],
  "Wolfson": [
    {
      "postId": "931103835686804",
      "text": "Oxfind me the hot californian A @ Wolfson, forgot to ask for your social!"
    }
  ]
}